{"format": "graph-model", "generatedBy": "2.17.0", "convertedBy": "TensorFlow.js Converter v4.21.0", "signature": {"inputs": {"input_layer": {"name": "input_layer:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "200"}, {"size": "200"}, {"size": "1"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "5"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_1/conv2d_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1_2/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1_2/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_2_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_2_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/flatten_1/Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "67712"}, {"size": "200"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "200"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1_2/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "200"}, {"size": "5"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1_2/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_layer", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "200"}, {"size": "200"}, {"size": "1"}]}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1/add", "op": "_FusedConv2D", "input": ["input_layer", "StatefulPartitionedCall/sequential_1/conv2d_1/convolution/ReadVariableOp", "StatefulPartitionedCall/sequential_1/conv2d_1/Reshape"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "filter_format": {"s": "SFdJTw=="}, "leakyrelu_alpha": {"f": 0.2}, "num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "-5"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "32"}]}]}}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1/max_pooling2d_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_1/conv2d_1/add"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_1/max_pooling2d_1/MaxPool2d"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1_2/add", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1/conv2d_1/Relu", "StatefulPartitionedCall/sequential_1/conv2d_1_2/convolution/ReadVariableOp", "StatefulPartitionedCall/sequential_1/conv2d_1_2/Reshape"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-8"}, {"size": "-12"}, {"size": "-13"}, {"size": "-14"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}]}}, "data_format": {"s": "TkhXQw=="}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "leakyrelu_alpha": {"f": 0.2}, "num_host_args": {"i": "0"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "filter_format": {"s": "SFdJTw=="}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/max_pooling2d_1_2/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_1/conv2d_1_2/add"], "attr": {"T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1_2/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_1/max_pooling2d_1_2/MaxPool2d"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_2_1/add", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1/conv2d_1_2/Relu", "StatefulPartitionedCall/sequential_1/conv2d_2_1/convolution/ReadVariableOp", "StatefulPartitionedCall/sequential_1/conv2d_2_1/Reshape"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-17"}, {"size": "-21"}, {"size": "-22"}, {"size": "-23"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}]}}, "num_host_args": {"i": "0"}, "filter_format": {"s": "SFdJTw=="}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/sequential_1/max_pooling2d_2_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_1/conv2d_2_1/add"], "attr": {"explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_2_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_1/max_pooling2d_2_1/MaxPool2d"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/flatten_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_1/conv2d_2_1/Relu", "StatefulPartitionedCall/sequential_1/flatten_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/flatten_1/Reshape", "StatefulPartitionedCall/sequential_1/dense_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_b": {"b": false}, "transpose_a": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-33"}, {"size": "67712"}]}, {"dim": [{"size": "67712"}, {"size": "200"}]}]}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1_2/Add", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/dense_1/Relu", "StatefulPartitionedCall/sequential_1/dense_1_2/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_1_2/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-33"}, {"size": "200"}]}, {"dim": [{"size": "200"}, {"size": "5"}]}]}}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "leakyrelu_alpha": {"f": 0.2}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1_2/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/sequential_1/dense_1_2/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_1/dense_1_2/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1882}}, "weightsManifest": [{"paths": ["group1-shard1of14.bin", "group1-shard2of14.bin", "group1-shard3of14.bin", "group1-shard4of14.bin", "group1-shard5of14.bin", "group1-shard6of14.bin", "group1-shard7of14.bin", "group1-shard8of14.bin", "group1-shard9of14.bin", "group1-shard10of14.bin", "group1-shard11of14.bin", "group1-shard12of14.bin", "group1-shard13of14.bin", "group1-shard14of14.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_1/conv2d_1/convolution/ReadVariableOp", "shape": [3, 3, 1, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1/Reshape", "shape": [1, 1, 1, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1_2/convolution/ReadVariableOp", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1_2/Reshape", "shape": [1, 1, 1, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_2_1/convolution/ReadVariableOp", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_2_1/Reshape", "shape": [1, 1, 1, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/flatten_1/Reshape/shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/Cast/ReadVariableOp", "shape": [67712, 200], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/Add/ReadVariableOp", "shape": [200], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_1_2/Cast/ReadVariableOp", "shape": [200, 5], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_1_2/Add/ReadVariableOp", "shape": [5], "dtype": "float32"}]}]}